Enum = {
    //类型检测枚举
    AllowType: {
        //非空类型
        NonEmpty: 0,
        //布尔类型
        Boolean: 1,
        //正整数类型
        PositiveInteger: 2,
        //整数类型
        Integer: 3,
        //数字类型
        Digital: 4,
        //邮箱类型
        Email: 5,
        //手机号码类型
        Mobile: 6
    },
    //缓存过期时间(毫秒)
    CacheExpirationTime: 600000,
    //忽略请求时长(毫秒)
    //ps: 该值指示范围时间内的重复请求会被合并成一次请求
    CacheIgnoredTime: 100,
    //周次枚举
    Week: ["星期日", "星期一", "星期二", "星期三", "星期四", "星期五", "星期六"],
    //颜色字典
    ColorLibrary: [
        '#3b5999', '#0084ff', '#55acee', '#0077B5', '#00AFF0', '#007ee5', '#21759b', '#1ab7ea', '#0077b5', '#4c75a3',
        '#34465d', '#410093', '#dd4b39', '#bd081c', '#cd201f', '#eb4924', '#ff5700', '#b92b27', '#af0606', '#df2029',
        '#da552f', '#ff6600', '#ff3300', '#f57d00', '#25D366', '#da552f', '#df2029', '#02b875', '#00b489', '#3aaf85',
        '#e4405f', '#ea4c89', '#ff0084', '#f94877', '#131418', '#FFFC00']
}